    ##### Index ######
# GVstrHowToUse： 提示使用者常用的功能
# GVstrNameCard_Info_Config： 名片資料下載
# GVstrVoWiFi_Info_Config： VoWiFi教學
# GVstrLessonLearning： 官方帳號教學
# GVstrCMKeyWord： 關鍵字說明CM
# GVstrECKeyWord： 關鍵字說明EC
    # ***** ***** ***** ***** *****


    ##### 預設留言 ######
GVstrHowToUse = '『臺南市新吉工業區廠協會』：\n' + \
                '您好！這是廠協會之官方帳號！\n謝謝您的訊息！\n我們會儘速以Line與您聯絡！\n\n' + \
                '也許您可用下述常用關鍵字查詢：\n' + \
                '「如何使用」\n' + \
                '「最新訊息」\n' + \
                '「成立資訊」\n' + \
                '「如何加入」\n' + \
                '「會址在那」\n' + \
                '「理事長由誰擔任」\n' + \
                '「會員名單」\n' + \
                '「理監事名單」\n' + \
                '「如何設定VoWiFi」\n' + \
                '「常用電話清單」\n' + \
                '「廠協會章程下載」\n' + \
                '「找」+公司或人或產品名\n' + \
                '「LOGO」等..'
    # ***** ***** ***** ***** *****


    ##### 銀行公用帳戶 ######
GVstrBankAccount_Info_Text = '『臺南市新吉工業區廠協會』帳戶：\n' + \
                                '台灣中小企業銀行\n' + \
                                '開戶銀行：東台南分行\n' + \
                                '分行代號：050-7211\n' + \
                                '\n' + \
                                '帳號：721-12-160117\n' + \
                                '戶名：臺南市新吉工業區廠商協進會林宗德\n'
    # ***** ***** ***** ***** *****

    ##### 理事長、總幹事 ######
GVstrChairman_Info_Text = '『臺南市新吉工業區廠協會』理事長：\n' + \
                                '第一屆第一次會員成立大會\n暨理監事聯席會議於2021/11/18(四)14:00舉行\n' + \
                                '選舉理事長為：\n東佑達自動化科技股份有限公司\n林宗德董事長擔任！'
GVstrDirectorGeneral_Info_Text = '『臺南市新吉工業區廠協會』總幹事：\n' + \
                                '第一屆第一次會員成立大會\n暨理監事聯席會議於2021/11/18(四)14:00舉行\n' + \
                                '選舉理事長為：\n東佑達自動化科技股份有限公司\n林宗德董事長擔任！\n' + \
                                '指派劉讃芳經理為總幹事！'
    # ***** ***** ***** ***** *****

    ##### 地址聯絡說明 ######
GVstrLocation_Phone_Info_Text = '『臺南市新吉工業區廠協會』地址/電話：\n' + \
                                '臺南市新吉工業區新吉三路55號\n' + \
                                '(06)202-1347 #總機6828 \n' + \
                                '(預定遷至：臺南市新吉工業區安新二路99號)\n' + \
                                '(申請中..新吉工業區服務中心..未來會址)\n' + \
                                '歡迎您的蒞臨指教！'
    # ***** ***** ***** ***** *****

    ##### 加入會員說明 ######
GVstrEstablish_Info_Text = '『臺南市新吉工業區廠協會』成立：\n' + \
                                '臺南市政府社會局2022/01/03(一)上午\n' + \
                                '通知協會立案通過！\n\n' + \
                                '成立歷程...\n' + \
                                '第一屆第一次會員成立大會\n' + \
                                '暨理監事聯席會議\n' + \
                                '於2021/11/18(四)14:00舉行\n' + \
                                '>同年 11/26(五)提出相關文件申請\n' + \
                                '>同年 12/10(五)社會局1st通知修改內容\n' + \
                                '>同年 12/24(一)社會局2nd通知修改內容\n' + \
                                '立案：南市社團字第1101543033號'
    # ***** ***** ***** ***** *****

    ##### 加入會員說明 ######
GVstrHow_To_Join_Info_Text = '『臺南市新吉工業區廠協會』加入：\n\n' + \
                                '(Step01)請下載並填寫『會員入會申請書』紙本\n' + \
                                'https://bit.ly/3GwQf4w\n' + \
                                '請填寫內容並用印(大小章)\n\n' + \
                                '(Step02)請用超連結：\n' + \
                                'https://forms.gle/bxDLMLgA2fSLCDia9\n' + \
                                '最上方處有廠協會帳戶資訊\n' + \
                                '匯款後請以手機或掃描方式留存匯款資料\n\n' + \
                                '(Step03)請用同超連結：\n' + \
                                'https://forms.gle/bxDLMLgA2fSLCDia9\n' + \
                                '上傳『會員入會申請書(用印)』之掃描檔\n' + \
                                '以及『匯款單』之照片或掃描檔\n\n' + \
                                '我們會盡快通知理事會並回覆！\n' + \
                                '感謝您的支持！'
    # ***** ***** ***** ***** *****

    ##### 查詢統一編號說明 ######
GVstrUniNumber_Info_Text = '『臺南市新吉工業區廠協會』：\n' + \
                                '立案(M103)：南市社團字第1101543033號\n' + \
                                '統編(M112)：89038129'
    # ***** ***** ***** ***** *****

    ##### 下載章程說明 ######
GVstrBylaws_DL_Info_Text = '廠協會章程下載：\n' + \
                            '  請點選下方路徑：\n' + \
                            '  https://bit.ly/3iyJLsk\n' + \
                            '\n' + \
                            '  民國 110 年 11 月 18 日第一屆第一次會員大會通過\n' + \
                            '\n' + \
                            '  台南市政府社會局民國 110 年 12 月 30 日\n' + \
                            '  南市社團字第 1101543033 號 函准予備查'

                            # '  連結：https://github.com/EctorLiu/Ector01/raw/main/files/(M323)SJ_Bylaws_1101543033.pdf\n' + \
    # ***** ***** ***** ***** *****

    ##### 下載名片檔案 ######
GVstrNameCard_Info_Config = '>> 名片建議設計兩面，其中一面為原本自己公司的設計\n' + \
                            '>> (1) 另外一面套用標準格式：\n' + \
                            '  Step01：名片格式說明\n' + \
                            '  連結：https://bit.ly/3sfaG0I\n' + \
                            '\n' + \
                            '>> (2) 可提供名片製作業者直接套用：\n' + \
                            '  Step02：AI檔案\n' + \
                            '  連結：https://bit.ly/3LfnmNP\n'

                            # '  連結：https://github.com/EctorLiu/Ector01/raw/main/files/(M127)SJ_Design_Text.jpg\n' + \
                            # '  連結：https://github.com/EctorLiu/Ector01/raw/main/files/(M127)SJ_Design_AI_File.ai\n' + \
    # ***** ***** ***** ***** *****

    ##### 下載VoWiFi說明 ######
GVstrVoWiFi_Info_Config = '>> 【VoWiFi】可在「電信訊號」不佳，\n' + \
                            '    但是「網路訊號」良好的情況下，順利通話！\n' + \
                            '    可用「網路」撥通「02-xxxx-xxxx 或 09xx-xxxxxx」！\n' + \
                            '\n' + \
                            '  Step01：參考VoWiFi說明\n' + \
                            '  連結：https://bit.ly/34JlWu8\n' + \
                            '\n' + \
                            '  Step02：聯絡手機的業者（遠傳、中華電信等）\n' + \
                            '      .. 請業者針對該手機門號，開啟VoWiFi功能\n' + \
                            '      .. 有的業者稱呼此服務為「WiFi通話功能」\n' + \
                            '      .. 依業者標準可能為免費，也可能需月租費用\n' + \
                            '      .. 請洽業者確認\n' + \
                            '\n' + \
                            '  Step03：開啟手機的VoWiFi功能\n' + \
                            '      .. (請參考上方的說明，或「Google」各機型開啟方法)\n'

                            # '  連結：https://github.com/EctorLiu/Ector01/raw/main/files/(M208)SJ_VoWiFi_Setup(V3).pdf\n' + \
    # ***** ***** ***** ***** *****

    ##### 教學資料 ######
GVstrLessonLearning = 'A1. 申請官方帳號：\n' + \
                    'https://manager.line.biz/\n' + \
                    '\n' + \
                    'A2. 自動回覆的類別有三種..\n' + \
                    '    (1) 『關鍵字』回應\n' + \
                    '    (2) 『智慧聊天』回應\n' + \
                    '    (3) 『程式』回應 (需自己寫程式)\n' + \
                    'A3. 第一種..『關鍵字』回應\n' + \
                    '    回應模式：選「聊天機器人」、Webhook：選「停用」\n' + \
                    'A4. 第二種..『智慧聊天』回應\n' + \
                    '    回應模式：選「聊天」\n' + \
                    'A5. 第三種..『程式』回應 (需自己寫程式)\n' + \
                    '    回應模式：選「聊天機器人」、Webhook：選「啟用」\n' + \
                    '    > 是用上面的設定決定哪一種回應方式..\n' + \
                    '\n' + \
                    'A6. 應用面的教學\n' + \
                    '    可參考範例1..\n' + \
                    'https://ithelp.ithome.com.tw/articles/10192259\n' + \
                    '    可參考範例2..\n' + \
                    'https://ithelp.ithome.com.tw/articles/10233234\n' + \
                    '\n' + \
                    'A7. 這個是我一開始看的官方文件：\n' + \
                    'https://developers.line.biz/zh-hant/docs/messaging-api/building-bot/\n' + \
                    'A8. 同上..Line官方有提供範例\n' + \
                    'https://developers.line.biz/zh-hant/docs/messaging-api/building-bot/\n' + \
                    '選擇語言進行開發..\n' + \
                    '\n' + \
                    'A9. 開發環境網站Line Develop（之後再看其他教學網站）\n' + \
                    'https://developers.line.biz/zh-hant/\n' + \
                    '\n' + \
                    'B1. 『推播』的話要拿權杖：\n' + \
                    'https://notify-bot.line.me/my/\n' + \
                    'B2. 『推播』教學可參考這一篇：\n' + \
                    'https://bustlec.github.io/note/2018/07/10/line-notify-using-python/'
    # ***** ***** ***** ***** *****

    ##### 關鍵字清單 ######
GVstrCMKeyWord = 'KW：\n' + \
                '[推播功能]\n' + \
                'SJ +\n' + \
                '*(1)推播ECTOR + 推播內容\n' + \
                '*(2)推播智弘 + 推播內容\n' + \
                '*(3)推播冠伶 + 推播內容\n' + \
                '*(4)推播昆霖 + 推播內容\n' + \
                '*(5)推播宜庭 + 推播內容\n' + \
                '*(6)推播全部 + 推播內容\n' + \
                '\n' + \
                '[關鍵字]\n' + \
                '(1)如何使用/HELP/?/？\n' + \
                '(2)(最近 or 最新) + (訊息 or 活動 or 新聞)\n' + \
                '(3)(進度 or 狀態 or 成立)n' + \
                '(4)(如何加入 or 加入會員)\n' + \
                '(5)(會址 or 地址 or 位置 or 住址 or 電話) + (在哪 or 在那 or 聯絡)\n' + \
                '(6)(理事長) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(7)(總幹事) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(8)(統編 or 統一編號 or 立案)\n' + \
                '\n' + \
                '[下載]\n' + \
                '(1)(LOGO)\n' + \
                '(2)(名片) + (製作 or 格式)\n' + \
                '(3)(使用 or 設定 or 通話) + (VOWIFI)\n' + \
                '(4)(廠協會 or 下載) + (章程)\n' + \
                '\n' + \
                '[資料庫]\n' + \
                '(1)(工業區 or 會員 or 廠協會) + (誰 or 名單 or 清單 or 列表 or 會員)\n' + \
                '(2)(理事 or 監事 or 理監事) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(3)(常用 or 電話 or 網址) + (名單 or 清單 or 列表)\n' + \
                '(4)(FIND or 找) + (關鍵字:公司營業項目)\n' + \
                '\n' + \
                '[內部使用]\n' + \
                '*(1)(SJ) + (MEMBER or DETAIL or 內用名單 or 詳細名單)\n' + \
                '*(2)(SJ) + (120 or $ or CASH or 零用金)\n' + \
                '*(3)(SJ) + (BANK) + (!55)\n' + \
                '\n' + \
                '[教學]\n' + \
                '(1)SJ官方帳號教學\n' + \
                ''
    # ***** ***** ***** ***** *****

    ##### 關鍵字清單 ######
GVstrECKeyWord = 'KW：\n' + \
                '[推播功能]\n' + \
                'TSVI +\n' + \
                '*(1)推播ECTOR + 推播內容\n' + \
                '*(2)推播智弘 + 推播內容\n' + \
                '*(3)推播冠伶 + 推播內容\n' + \
                '*(4)推播昆霖 + 推播內容\n' + \
                '*(5)推播宜庭 + 推播內容\n' + \
                '*(6)推播全部 + 推播內容\n' + \
                '\n' + \
                '[關鍵字]\n' + \
                '(1)如何使用/HELP/?/？\n' + \
                '(2)(最近 or 最新) + (訊息 or 活動 or 新聞)\n' + \
                '(3)(進度 or 狀態 or 成立)n' + \
                '(4)(如何加入 or 加入會員)\n' + \
                '(5)(會址 or 地址 or 位置 or 住址 or 電話) + (在哪 or 在那 or 聯絡)\n' + \
                '(6)(理事長) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(7)(總幹事) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(8)(統編 or 統一編號 or 立案)\n' + \
                '\n' + \
                '[下載]\n' + \
                '(1)(LOGO)\n' + \
                '(2)(名片) + (製作 or 格式)\n' + \
                '(3)(使用 or 設定 or 通話) + (VOWIFI)\n' + \
                '(4)(廠協會 or 下載) + (章程)\n' + \
                '\n' + \
                '[資料庫]\n' + \
                '(1)(工業區 or 會員 or 廠協會) + (誰 or 名單 or 清單 or 列表 or 會員)\n' + \
                '(2)(理事 or 監事 or 理監事) + (誰 or 名單 or 清單 or 列表)\n' + \
                '(3)(常用 or 電話 or 網址) + (名單 or 清單 or 列表)\n' + \
                '(4)(FIND or 找) + (關鍵字:公司營業項目)\n' + \
                '\n' + \
                '[內部使用]\n' + \
                '*(1)(SJ) + (MEMBER or DETAIL or 內用名單 or 詳細名單)\n' + \
                '*(2)(SJ) + (120 or $ or CASH or 零用金)\n' + \
                '*(3)(SJ) + (BANK or 銀行)\n' + \
                '\n' + \
                '[教學]\n' + \
                '(1)SJ官方帳號教學' + \
                '\n' + \
                '[測試中]\n' + \
                'SJ +\n' + \
                '(1)樣版\n' + \
                '\n' + \
                '[ECTOR]\n' + \
                '(1)E.4. + HN + (KW or LINE)\n' + \
                ''
    # ***** ***** ***** ***** *****
